{
  "cough": "Drink warm water mixed with turmeric and honey.",
  "cold": "Try steam inhalation with eucalyptus oil.",
  "headache": "Apply a paste of sandalwood on your forehead.",
  "acidity": "Drink a glass of cold milk or chew fennel seeds.",
  "constipation": "Consume warm water with lemon and honey every morning.",
  "indigestion": "Chew a small piece of fresh ginger with salt before meals.",
  "nausea": "Sip on ginger tea or chew on ginger candy.",
  "diarrhea": "Eat boiled rice with yogurt or drink pomegranate juice.",
  "gas": "Drink warm water with ajwain (carom seeds) and black salt.",
  "vomiting": "Suck on a clove or drink lemon juice with a pinch of cardamom powder.",
  "fever": "Drink basil (tulsi) tea with honey.",
  "sore throat": "Gargle with warm salt water and drink turmeric milk.",
  "toothache": "Apply clove oil directly to the affected tooth.",
  "eye strain": "Splash cold water on your eyes and apply rose water.",
  "earache": "Warm garlic oil drops can relieve ear pain.",
  "back pain": "Massage with warm sesame oil and do gentle yoga stretches.",
  "joint pain": "Apply turmeric paste or drink turmeric milk regularly.",
  "knee pain": "Massage with castor oil or apply fenugreek seed paste.",
  "muscle cramps": "Drink water with rock salt and stretch the muscle gently.",
  "stress": "Practice meditation and drink ashwagandha tea.",
  "anxiety": "Have Brahmi tea and practice deep breathing exercises.",
  "insomnia": "Drink warm milk with nutmeg before bed.",
  "fatigue": "Eat dates and almonds soaked overnight.",
  "low immunity": "Take chyawanprash daily and eat citrus fruits.",
  "hair fall": "Apply onion juice or coconut oil with hibiscus.",
  "dandruff": "Use neem oil or a lemon juice rinse.",
  "dry scalp": "Massage with almond oil and leave overnight.",
  "greying hair": "Apply curry leaf and coconut oil mix.",
  "acne": "Apply a paste of turmeric and sandalwood.",
  "pimples": "Use a neem leaf paste on affected areas.",
  "oily skin": "Wash with multani mitti (fuller's earth) face pack.",
  "dry skin": "Apply aloe vera gel and coconut oil mixture.",
  "eczema": "Apply neem oil or turmeric paste on the patch.",
  "psoriasis": "Use aloe vera gel and bathe in neem leaf water.",
  "sunburn": "Apply sandalwood paste or aloe vera gel.",
  "dark circles": "Place cucumber slices or potato juice under eyes.",
  "eye redness": "Use a rose water compress on closed eyes.",
  "nosebleeds": "Put a few drops of pomegranate juice in nostrils.",
  "high blood pressure": "Drink coriander seed water in the morning.",
  "low blood pressure": "Consume salt and lemon water for quick relief.",
  "cholesterol": "Eat garlic daily and avoid oily food.",
  "diabetes": "Drink karela (bitter gourd) juice every morning.",
  "thyroid": "Eat iodine-rich foods and drink ashwagandha tea.",
  "weight loss": "Drink lukewarm water with lemon and honey.",
  "weight gain": "Consume bananas with milk and eat healthy fats.",
  "poor appetite": "Chew fennel seeds and drink mint tea.",
  "bloating": "Drink ajwain and ginger tea after meals.",
  "mouth ulcers": "Apply honey and turmeric paste on ulcers.",
  "bad breath": "Chew cardamom or clove after meals.",
  "sensitive teeth": "Use mustard oil with rock salt to brush.",
  "gout": "Eat cherries and avoid high-purine foods.",
  "urinary infection": "Drink barley water and coconut water.",
  "kidney stones": "Drink basil juice and lots of water.",

  "burns": "Apply aloe vera gel or honey on the burn area.",
  "cuts": "Use turmeric paste or clean with neem water.",
  "bruises": "Apply cold turmeric and sandalwood paste.",
  "scars": "Use rosehip oil or massage with coconut oil.",
  "skin allergies": "Apply neem leaf paste or sandalwood with rose water.",
  "itching": "Use chickpea flour with turmeric as a bath scrub.",
  "ringworm": "Apply garlic paste or raw papaya paste.",
  "wounds": "Clean with turmeric water and apply honey.",
  "bleeding gums": "Massage with neem bark powder or clove oil.",
  "dry lips": "Apply ghee or coconut oil regularly.",
  "chapped heels": "Apply a mixture of wax and mustard oil at night.",
  "cracked nails": "Soak in warm coconut oil with lemon juice.",
  "menstrual pain": "Drink cinnamon tea and apply warm compress.",
  "irregular periods": "Consume sesame seed powder with jaggery.",
  "heavy periods": "Drink coriander seed tea and rest.",
  "white discharge": "Drink fenugreek seed water or amla juice.",
  "pcos": "Drink spearmint tea and avoid refined carbs.",
  "infertility": "Consume ashwagandha and shatavari under guidance.",
  "pregnancy nausea": "Suck on cardamom or lemon with salt.",
  "lactation issues": "Consume fenugreek seeds and garlic in meals.",
  "baby cough": "Rub warm ajwain on cloth and place near baby.",
  "baby cold": "Massage baby with mustard oil and garlic.",
  "teething pain": "Rub honey and clove paste on gums (for older babies).",
  "eye infection": "Wash eyes with triphala water or neem water.",
  "ear wax": "Use warm sesame oil drops for gentle softening.",
  "throat infection": "Drink tulsi and mulethi tea.",
  "voice loss": "Gargle with turmeric and saltwater mix.",
  "snoring": "Use eucalyptus oil steam before sleep.",
  "varicose veins": "Massage with mustard oil and elevate legs.",
  "asthma": "Inhale steam with ajwain and drink ginger juice.",
  "bronchitis": "Drink tulsi, ginger, and honey tea.",
  "allergy": "Consume turmeric and black pepper with warm milk.",
  "sinusitis": "Inhale steam with eucalyptus and turmeric.",
  "migraine": "Apply sandalwood paste and lie in a dark room.",
  "motion sickness": "Chew on ginger or suck lemon with salt.",
  "travel fatigue": "Drink water with mint and rock salt.",
  "weak eyesight": "Eat carrots, amla, and practice eye yoga.",
  "memory loss": "Consume almonds soaked overnight and Brahmi.",
  "concentration issues": "Use shankhpushpi syrup and meditate daily.",
  "liver issues": "Drink aloe vera and kutki juice under guidance.",
  "jaundice": "Drink sugarcane juice and eat papaya leaves.",
  "anemia": "Consume beetroot, dates, and jaggery regularly.",
  "low libido": "Use ashwagandha and shilajit (consult Ayurvedic doctor).",
  "bedwetting": "Give amla powder with honey before bedtime.",
  "nightmares": "Drink nutmeg milk before sleep and meditate.",
  "hyperacidity": "Chew tulsi leaves and drink coriander tea.",
  "mouth odor": "Rinse with mint leaf decoction.",
  "hangover": "Drink amla juice and coconut water.",
  "dehydration": "Drink buttermilk with rock salt and cumin."
}
